MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO120LC2BN/mcu.h
#define LCD_MEM_9_SEG_2_4x_Pos           (16)                                              /*!< LCD_T::MEM_9: SEG_2_4x Position           */
#define LCD_MEM_9_SEG_2_4x_Msk           (0x3ful << LCD_MEM_9_SEG_2_4x_Pos)                /*!< LCD_T::MEM_9: SEG_2_4x Mask               */

#define LCD_MEM_9_SEG_3_4x_Pos           (24)                                              /*!< LCD_T::MEM_9: SEG_3_4x Position           */
#define LCD_MEM_9_SEG_3_4x_Msk           (0x3ful << LCD_MEM_9_SEG_3_4x_Pos)                /*!< LCD_T::MEM_9: SEG_3_4x Mask               */

#define LCD_FCR_FCEN_Pos                 (0)                                               /*!< LCD_T::FCR: FCEN Position                 */
#define LCD_FCR_FCEN_Msk                 (0x1ul << LCD_FCR_FCEN_Pos)                       /*!< LCD_T::FCR: FCEN Mask                     */

#define LCD_FCR_FCINTEN_Pos              (1)                                               /*!< LCD_T::FCR: FCINTEN Position              */
#define LCD_FCR_FCINTEN_Msk              (0x1ul << LCD_FCR_FCINTEN_Pos)                    /*!< LCD_T::FCR: FCINTEN Mask                  */

#define LCD_FCR_PRESCL_Pos               (2)                                               /*!< LCD_T::FCR: PRESCL Position               */
#define LCD_FCR_PRESCL_Msk               (0x3ul << LCD_FCR_PRESCL_Pos)                     /*!< LCD_T::FCR: PRESCL Mask                   */

#define LCD_FCR_FCV_Pos                  (4)                                               /*!< LCD_T::FCR: FCV Position                  */
#define LCD_FCR_FCV_Msk                  (0x3ful << LCD_FCR_FCV_Pos)                       /*!< LCD_T::FCR: FCV Mask                      */

#define LCD_FCSTS_FCSTS_Pos              (0)                                               /*!< LCD_T::FCSTS: FCSTS Position              */
#define LCD_FCSTS_FCSTS_Msk              (0x1ul << LCD_FCSTS_FCSTS_Pos)                    /*!< LCD_T::FCSTS: FCSTS Mask                  */

#define LCD_FCSTS_PDSTS_Pos              (1)                                               /*!< LCD_T::FCSTS: PDSTS Position              */
#define LCD_FCSTS_PDSTS_Msk              (0x1ul << LCD_FCSTS_PDSTS_Pos)                    /*!< LCD_T::FCSTS: PDSTS Mask                  */

/**@}*/ /* LCD_CONST */
/**@}*/ /* end of LCD register group */


/*---------------------- Peripheral Direct Memory Access Controller -------------------------*/
/**
    @addtogroup DMA Direct Memory Access Controller(DMA)
    Memory Mapped Structure for DMA Controller
@{ */


typedef struct
{


    /**
     * CTL
     * ===================================================================================================
     * Offset: 0x00  DMA CRC Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CRCCEN    |CRC Channel Enable
     * |        |          |Setting this bit to 1 enables CRC's operation.
     * |        |          |When operating in CRC DMA mode (TRIG_EN = 1), if user clear this bit, the DMA operation will be continuous until all CRC DMA operation done, and the TRIG_EN bit will asserted until all CRC DMA operation done.
     * |        |          |But in this case, the CRC_DMAISR [BLKD_IF] flag will inactive, user can read CRC result by reading CRC_CHECKSUM register when TRIG_EN = 0.
     * |        |          |When operating in CRC DMA mode (TRIG_EN = 1), if user want to stop the transfer immediately, user can write 1 to CRC_RST bit to stop the transmission.
     * |[1]     |CRC_RST   |CRC Engine Reset
     * |        |          |0 = Writing 0 to this bit has no effect.
     * |        |          |1 = Writing 1 to this bit will reset the internal CRC state machine and internal buffer.
     * |        |          |The contents of control register will not be cleared.
     * |        |          |This bit will be auto cleared after few clock cycles.
     * |        |          |Note: When operating in CPU PIO mode, setting this bit will reload the initial seed value
     * |[23]    |TRIG_EN   |Trigger Enable
     * |        |          |0 = No effect.
     * |        |          |1 = CRC DMA data read or write transfer Enabled.
     * |        |          |Note1: If this bit assert that indicates the CRC engine operation in CRC DMA mode, so don't filled any data in CRC_WDATA register.
     * |        |          |Note2: When CRC DMA transfer completed, this bit will be cleared automatically.
     * |        |          |Note3: If the bus error occurs, all CRC DMA transfer will be stopped.
     * |        |          |Software must reset all DMA channel, and then trigger again.
     * |[24]    |WDATA_RVS |Write Data Order Reverse
     * |        |          |0 = No bit order reverse for CRC write data in.
     * |        |          |1 = Bit order reverse for CRC write data in (per byre).
     * |        |          |Note: If the write data is 0xAABBCCDD, the bit order reverse for CRC write data in is 0x55DD33BB
     * |[25]    |CHECKSUM_RVS|Checksum Reverse
     * |        |          |0 = No bit order reverse for CRC checksum.
     * |        |          |1 = Bit order reverse for CRC checksum.
     * |        |          |Note: If the checksum data is 0XDD7B0F2E, the bit order reverse for CRC checksum is 0x74F0DEBB
     * |[26]    |WDATA_COM |Write Data Complement
     * |        |          |0 = No bit order reverse for CRC write data in.
     * |        |          |1 = 1's complement for CRC write data in.
     * |[27]    |CHECKSUM_COM|Checksum Complement
     * |        |          |0 = No bit order reverse for CRC checksum.
     * |        |          |1 = 1's complement for CRC checksum.
     * |[29:28] |CPU_WDLEN |CPU Write Data Length
     * |        |          |When operating in CPU PIO mode (CRCCEN= 1, TRIG_EN = 0), this field indicates the write data length.
     * |        |          |00 = The data length is 8-bit mode
     * |        |          |01 = The data length is 16-bit mode
     * |        |          |10 = The data length is 32-bit mode
     * |        |          |11 = Reserved
     * |        |          |Note1: This field is only used for CPU PIO mode.
     * |        |          |Note2: When the data length is 8-bit mode, the valid data is CRC_WDATA [7:0], and if the data length is 16 bit mode, the valid data is CRC_WDATA [15:0].
     * |[31:30] |CRC_MODE  |CRC Polynomial Mode
     * |        |          |00 = CRC-CCITT Polynomial Mode
     * |        |          |01 = CRC-8 Polynomial Mode
     * |        |          |10 = CRC-16 Polynomial Mode
     * |        |          |11 = CRC-32 Polynomial Mode
    */
    __IO uint32_t CTL;

    /**
     * DMASAR
     * ===================================================================================================
     * Offset: 0x04  DMA CRC Source Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |CRC_DMASAR|CRC DMA Transfer Source Address Register
     * |        |          |This field indicates a 32-bit source address of CRC DMA.
     * |        |          |Note : The source address must be word alignment
    */
    __IO uint32_t DMASAR;
    uint32_t RESERVE0[1];


    /**
     * DMABCR
     * ===================================================================================================
     * Offset: 0x0C  DMA CRC Transfer Byte Count Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CRC_DMABCR|CRC DMA Transfer Byte Count Register
     * |        |          |This field indicates a 16-bit transfer byte count number of CRC DMA
    */
    __IO uint32_t DMABCR;
    uint32_t RESERVE1[1];


    /**
     * DMACSAR
     * ===================================================================================================
     * Offset: 0x14  DMA CRC Current Source Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |CRC_DMACSAR|CRC DMA Current Source Address Register (Read Only)
     * |        |          |This field indicates the source address where the CRC DMA transfer is just occurring.
    */
    __I  uint32_t DMACSAR;
    uint32_t RESERVE2[1];


    /**
     * DMACBCR
     * ===================================================================================================
     * Offset: 0x1C  DMA CRC Current Transfer Byte Count Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CRC_DMACBCR|CRC DMA Current Byte Count Register (Read Only)
     * |        |          |This field indicates the current remained byte count of CRC_DMA.
     * |        |          |Note: CRC_RST will clear this register value.
    */
    __I  uint32_t DMACBCR;

    /**
     * DMAIER
     * ===================================================================================================
     * Offset: 0x20  DMA CRC Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TABORT_IE |CRC DMA Read/Write Target Abort Interrupt Enable
     * |        |          |0 = Target abort interrupt generation Disabled during CRC DMA transfer.
     * |        |          |1 = Target abort interrupt generation Enabled during CRC DMA transfer.
     * |[1]     |BLKD_IE   |CRC DMA Transfer Done Interrupt Enable
     * |        |          |0 = Interrupt generator Disabled during CRC DMA transfer done.
     * |        |          |1 = Interrupt generator Enabled during CRC DMA transfer done.
    */
    __IO uint32_t DMAIER;

    /**
     * DMAISR
     * ===================================================================================================
     * Offset: 0x24  DMA CRC Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TABORT_IF |CRC DMA Read/Write Target Abort Interrupt Flag
     * |        |          |0 = No bus ERROR response received.
     * |        |          |1 = Bus ERROR response received.
     * |        |          |Software can write 1 to clear this bit to zero
     * |        |          |Note: The CRC_DMAISR [TABORT_IF] indicate bus master received ERROR response or not.
     * |        |          |If bus master received ERROR response, it means that target abort is happened.
     * |        |          |DMA will stop transfer and respond this event to software then go to IDLE state.
     * |        |          |When target abort occurred, software must reset DMA, and then transfer those data again.
     * |[1]     |BLKD_IF   |Block Transfer Done Interrupt Flag
     * |        |          |This bit indicates that CRC DMA has finished all transfer.
     * |        |          |0 = Not finished yet.
     * |        |          |1 = Done.
     * |        |          |Software can write 1 to clear this bit to zero
    */
    __IO uint32_t DMAISR;
    uint32_t RESERVE3[22];


    /**
     * WDATA
     * ===================================================================================================
     * Offset: 0x80  DMA CRC Write Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |CRC_WDATA |CRC Write Data Register
     * |        |          |When operating in CPU PIO (CRC_CTL [CRCCEN] = 1, CRC_CTL [TRIG_EN] = 0) mode, software can write data to this field to perform CRC operation;.
     * |        |          |When operating in CRC DMA mode (CRC_CTL [CRCCEN] = 1, CRC_CTL [TRIG_EN] = 0), this field will be used for DMA internal buffer.
     * |        |          |Note1: When operating in CRC DMA mode, so don't filled any data in this field.
     * |        |          |Note2:The CRC_CTL [WDATA_COM] and CRC_CTL [WDATA_RVS] bit setting will affected this field; For example, if WDATA_RVS = 1, if the write data in CRC_WDATA register is 0xAABBCCDD, the read data from CRC_WDATA register will be 0x55DD33BB
    */
    __IO uint32_t WDATA;

    /**
     * SEED
     * ===================================================================================================
     * Offset: 0x84  DMA CRC Seed Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |CRC_SEED  |CRC Seed Register
     * |        |          |This field indicates the CRC seed value.
    */
    __IO uint32_t SEED;

    /**
     * CHECKSUM
     * ===================================================================================================
     * Offset: 0x88  DMA CRC Check Sum Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |CRC_CHECKSUM|CRC Checksum Register
     * |        |          |This field indicates the CRC checksum
    */
    __I  uint32_t CHECKSUM;

} DMA_CRC_T;


typedef struct
{


    /**
     * GCRCSR
     * ===================================================================================================
     * Offset: 0x00  DMA Global Control and Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[8]     |CLK0_EN   |DMA Controller Channel 0 Clock Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[9]     |CLK1_EN   |DMA Controller Channel 1 Clock Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[10]    |CLK2_EN   |DMA Controller Channel 2 Clock Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[11]    |CLK3_EN   |DMA Controller Channel 3 Clock Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[12]    |CLK4_EN   |DMA Controller Channel 4 Clock Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[13]    |CLK5_EN   |DMA Controller Channel 5 Clock Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[14]    |CLK6_EN   |DMA Controller Channel 6 Clock Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[24]    |CRC_CLK_EN|CRC Controller Clock Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
    */
    __IO uint32_t GCRCSR;

    /**
     * DSSR0
     * ===================================================================================================
     * Offset: 0x04  DMA Service Selection Control Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[12:8]  |CH1_SEL   |Channel 1 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 1.
     * |        |          |Software can configure the peripheral by setting CH1_SEL.
     * |        |          |00000 = Connect to SPI0_TX.
     * |        |          |00001 = Connect to SPI1_TX.
     * |        |          |00010 = Connect to UART0_TX.
     * |        |          |00011 = Connect to UART1_TX.
     * |        |          |00100 = Connect to USB_TX.
     * |        |          |00101 = Connect to I2S_TX.
     * |        |          |00110 = Connect to DAC0_TX.
     * |        |          |00111 = Connect to DAC1_TX.
     * |        |          |01000 = Connect to SPI2_TX.
     * |        |          |01001 = Connect to TMR0.
     * |        |          |01010 = Connect to TMR1.
     * |        |          |01011 = Connect to TMR2.
     * |        |          |01100 = Connect to TMR3.
     * |        |          |10000 = Connect to SPI0_RX.
     * |        |          |10001 = Connect to SPI1_RX.
     * |        |          |10010 = Connect to UART0_RX.
     * |        |          |10011 = Connect to UART1_RX.
     * |        |          |10100 = Connect to USB_RX.
     * |        |          |10101 = Connect to I2S_RX.
     * |        |          |10110 = Connect to ADC.
     * |        |          |11000 = Connect to SPI2_RX.
     * |        |          |11001 = Connect to PWM0_CH0.
     * |        |          |11010 = Connect to PWM0_CH2.
     * |        |          |11011 = Connect to PWM1_CH0.
     * |        |          |11100 = Connect to PWM1_CH2.
     * |[20:16] |CH2_SEL   |Channel 2 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 2.
     * |        |          |Software can configure the peripheral setting by CH2_SEL.
     * |        |          |The channel configuration is the same as CH1_SEL field.
     * |        |          |Please refer to the explanation of CH1_SEL.
     * |[28:24] |CH3_SEL   |Channel 3 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 3.
     * |        |          |Software can configure the peripheral setting by CH3_SEL.
     * |        |          |The channel configuration is the same as CH1_SEL field.
     * |        |          |Please refer to the explanation of CH1_SEL.
    */
    __IO uint32_t DSSR0;

    /**
     * DSSR1
     * ===================================================================================================
     * Offset: 0x08  DMA Service Selection Control Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:0]   |CH4_SEL   |Channel 4 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 4.
     * |        |          |Software can configure the peripheral by setting CH4_SEL.
     * |        |          |The channel configuration is the same as CH1_SEL field.
     * |        |          |Please refer to the explanation of CH1_SEL.
     * |[12:8]  |CH5_SEL   |Channel 5 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 5.
     * |        |          |Software can configure the peripheral setting by CH5_SEL.
     * |        |          |The channel configuration is the same as CH1_SEL field.
     * |        |          |Please refer to the explanation of CH1_SEL.
     * |[20:16] |CH6_SEL   |Channel 6 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 6.
     * |        |          |Software can configure the peripheral setting by CH6_SEL.
     * |        |          |The channel configuration is the same as CH1_SEL field.
     * |        |          |Please refer to the explanation of CH1_SEL.
    */
    __IO uint32_t DSSR1;

    /**
     * GCRISR
     * ===================================================================================================
     * Offset: 0x0C  DMA Global Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |INTR0     |Interrupt Pin Status Of Channel 0 (Read Only)
     * |        |          |This bit is the Interrupt pin status of DMA channel0.
     * |        |          |Note: This bit is read only
     * |[1]     |INTR1     |Interrupt Pin Status Of Channel 1 (Read Only)
     * |        |          |This bit is the Interrupt pin status of DMA channel1.
     * |        |          |Note: This bit is read only
     * |[2]     |INTR2     |Interrupt Pin Status Of Channel 2 (Read Only)
     * |        |          |This bit is the Interrupt pin status of DMA channel2.
     * |        |          |Note: This bit is read only
     * |[3]     |INTR3     |Interrupt Pin Status Of Channel 3 (Read Only)
     * |        |          |This bit is the Interrupt pin status of DMA channel3.
     * |        |          |Note: This bit is read only
     * |[4]     |INTR4     |Interrupt Pin Status Of Channel 4 (Read Only)
     * |        |          |This bit is the Interrupt pin status of DMA channel4.
     * |        |          |Note: This bit is read only
     * |[5]     |INTR5     |Interrupt Pin Status Of Channel 5 (Read Only)
     * |        |          |This bit is the Interrupt pin status of DMA channel4.
     * |        |          |Note: This bit is read only
     * |[6]     |INTR6     |Interrupt Pin Status Of Channel 6 (Read Only)
     * |        |          |This bit is the Interrupt pin status of DMA channel4.
     * |        |          |Note: This bit is read only
     * |[16]    |CRC_INTR  |Interrupt Pin Status Of CRC Controller
     * |        |          |This bit is the Interrupt status of CRC controller
     * |        |          |Note: This bit is read only
    */
    __I  uint32_t GCRISR;

